fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

	// ВКМ_Доработка: Удаление из проверки реквизита Основание 
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВидДоговора");
	
	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда 
		
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Основание")); 
		
	КонецЕсли;
	
КонецПроцедуры 
	// ВКМ_Доработка:конец.

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
	// ВКМ_Доработка: Добавление кода 
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВидДоговора") = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Если  Товары.Количество() <> 0 Тогда
			
			ТекстСообщения = "По договору абонентского обслуживания не предусмотрена продажа товара. Очистите вкладку товары и повторите сохранение документа.
			|Сохранение документа реализации товаров и услуг невозможно. ";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
			
		ИначеЕсли Услуги.Количество() = 0 Тогда
			
			ТекстСообщения = "В документе должна быть указана хотя бы одна услуга.
			|Сохранение документа реализации товаров и услуг невозможно. ";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
			
		ИначеЕсли  Не НоменклатураЗаполненаВерно()Тогда
			
			ТекстСообщения = СтрШаблон("В акте реализации товаров и услуг с договором абонентского обслуживания в качестве услуг могут быть только два наименования:
			|%1 и 
			|%2.
			|Сохранение документа реализации товаров и услуг невозможно. ",
			Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить(),
			Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить());
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
			
		ИначеЕсли  BKM_ДокРеализацияДоработкаСервер.НайтиТекущуюРеализацию(ЭтотОбъект) <> Неопределено Тогда
			
			// Проверка на уже существующий документ с договором абонентского обслуживания 
			ТекстСообщения = "На текущий период по данному договору уже есть составленный документ.
			|Сохранение документа реализации товаров и услуг невозможно. ";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ); 
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли; 
	// ВКМ_Доработка:конец.
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	//движение по заказам
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	//движение по остаткам товаров
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	//ВКМ_Доработка:Заполнение регистра ВКМ_ВыполненныеКлиентуРаботы 

	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;

	Для Каждого СтрУслуги Из Услуги Цикл
    	// Исключаем работы из Док-та Обслужтвание
    	Если СтрУслуги.Номенклатура = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить() Тогда
        	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.ДобавитьРасход();
        	Движение.Период = Дата;
        	Движение.Клиент = Контрагент;
        	Движение.Договор = Договор;
        	Движение.КоличествоЧасов = СтрУслуги.Количество;
        	Движение.СуммаКОплате = СтрУслуги.Сумма;
    	КонецЕсли;
	КонецЦикла;

	// ВКМ_Доработка:конец.	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказПокупателя.Организация КАК Организация,
	|	ЗаказПокупателя.Контрагент КАК Контрагент,
	|	ЗаказПокупателя.Договор КАК Договор,
	|	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	|	ЗаказПокупателя.Товары.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма) КАК Товары,
	|	ЗаказПокупателя.Услуги.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма) КАК Услуги
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока УслугиОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

// ВКМ_Доработка: Добавление функций на проверку номенклатуры

Функция НоменклатураЗаполненаВерно()
	
	Для Каждого Услуга Из Услуги Цикл
		Если Услуга.Номенклатура <> Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить()
			И Услуга.Номенклатура <> Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить() Тогда
				Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;	
	
КонецФункции

Процедура BKM_ВыполнитьАвтозаполнение() Экспорт
	
	// Получаем данные констант
	АбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	РаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	Если Не ЗначениеЗаполнено(АбонентскаяПлата) Или Не ЗначениеЗаполнено(РаботыСпециалиста) Тогда
		ОбщегоНазначения.СообщитьПользователю("Проверить заполнения Контсант");
		Возврат;
	КонецЕсли;

	// Очищаем перед заполнением 
	Услуги.Очистить(); 

	// Заполняем Абонентскую плату из договора
	АбонентскаяПлатаИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_АбонентскаяПлата");
	
	Если АбонентскаяПлатаИзДоговора > 0 Тогда
		ЗапросАбПл = Новый Запрос;
		ЗапросАбПл.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	РеализацияУслуги.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияУслуги
			|ГДЕ
			|	РеализацияУслуги.Ссылка.Договор = &Договор
			|	И РеализацияУслуги.Ссылка.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
			|	И РеализацияУслуги.Номенклатура = &НоменклатураАбонплата
			|	И РеализацияУслуги.Ссылка.Проведен
			|	И РеализацияУслуги.Ссылка <> &ТекущийДокумент"; 

		ЗапросАбПл.УстановитьПараметр("Договор", Договор);
		ЗапросАбПл.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
		ЗапросАбПл.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
		ЗапросАбПл.УстановитьПараметр("НоменклатураАбонплата", АбонентскаяПлата);
		ЗапросАбПл.УстановитьПараметр("ТекущийДокумент", Ссылка);

		Если ЗапросАбПл.Выполнить().Пустой() Тогда
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.Номенклатура = АбонентскаяПлата;
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Цена = АбонентскаяПлатаИзДоговора;
			НоваяСтрока.Сумма = АбонентскаяПлатаИзДоговора;
		КонецЕсли;
	КонецЕсли;

	//Заполняем неоплаченные остатки 
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	СУММА(Т.Количество) КАК Количество,
        |	СУММА(Т.Сумма) КАК Сумма
        |ИЗ
        |	(ВЫБРАТЬ
        |		ЕСТЬNULL(Остатки.КоличествоЧасовОстаток, 0) КАК Количество,
        |		ЕСТЬNULL(Остатки.СуммаКОплатеОстаток, 0) КАК Сумма
        |	ИЗ
        |		РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Остатки(&Граница, Договор = &Договор) КАК Остатки
        |	
        |	ОБЪЕДИНИТЬ ВСЕ
        |	
        |	ВЫБРАТЬ
        |		Услуги.Количество,
        |		Услуги.Сумма
        |	ИЗ
        |		Документ.РеализацияТоваровУслуг.Услуги КАК Услуги
        |	ГДЕ
        |		Услуги.Ссылка = &ТекущийДокумент
        |		И Услуги.Ссылка.Проведен
        |		И Услуги.Номенклатура = &НоменклатураРабот) КАК Т";

    // Остатки на конец месяца
    Запрос.УстановитьПараметр("Граница", Новый Граница(КонецМесяца(Дата), ВидГраницы.Включая));
    Запрос.УстановитьПараметр("Договор", Договор);
    Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
    Запрос.УстановитьПараметр("НоменклатураРабот", РаботыСпециалиста);

    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Сумма) И Выборка.Сумма > 0 Тогда
        НоваяСтрока = Услуги.Добавить();
        НоваяСтрока.Номенклатура = РаботыСпециалиста;
        НоваяСтрока.Количество = Выборка.Количество;
        НоваяСтрока.Цена = ?(Выборка.Количество <> 0, Выборка.Сумма / Выборка.Количество, Выборка.Сумма);
        НоваяСтрока.Сумма = Выборка.Сумма;
    КонецЕсли;

    СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
		
КонецПроцедуры

// ВКМ_Доработка:конец

#КонецОбласти

#КонецЕсли
